'''
Это как сердце Git - это система котроля версий,
разработанная Линуксом Торвальдсом (человек, создавшим Linux).



# **Что такое система контроя версий?**

Когда разработчики создают новый проект, они всегда продолжаит вносить обнавления в код.
Даже после запуска проектов им всё равно нужно обновлять верси, исправить ошибки,

Система контроля версий помогает отслеживать изменения, внесённые в базу кода кода.'
Более того, он записывает, кто внес изменнения и может восстановить стёртый или изменённый код.

Перезаписанных кодов не сушествует, поскольку Git сохроняет несколько копий в хранилище.

# **Что такое Hub?**

Если Git - это сердце Github, то Hub это его душа.
Концентратор в Github - это то, что превращает командную строку,
такую как Git, в крупнейшую социальную сеть для разработчиков.

# **Репозиторий**

Репозиторий или хранилище - это каталог, в котором  хранятся файлы вашего проекта.
Он может быть распаложен в хранилище Github или в локальном хранилище на вашем компьютере.
Вы можете хранить файлы кодов, изображения, аудио или всё, что связано с проектом, в хранилище.

# **Ветка**

Ветка это копия вашего репозитория. Вы можете использовать ветку, когда хотите сделать разработку изолировано.

Работа в веткой не повлияет на центральное хранилище или другие ветки.
Если вы сделали эту работу, вы можете объединить свою ветку с другими ветками и центральными репозитория,
используя запрос на извлечение.

# **Запрос на извлечение**

Запрос на извлечение означает, что вы сообщаете другим, что вы передали изменения,
внесённые вами в ветке, в главный репозиторий. Совторы хранилища могут принять
или отклонить запрос на извлечение. После того как они приняли запрос, они могут обсудить и проанализировать свою работу с совторыми.

Форкинг репозитория означает, что вы создаёте новый проект на основе существующего репозитория.
Говоря простым языком, разветвление репозитория означает, что вы копируете существующий репозиторий,
вносите некоторые необходимые изменения, сохраняете новую версию в качестве нового репозитория
и называете это своим собственным проектом.

Это отличная функция, которая ускоряет разработку проектов.
Поскольку это совершенно новый проект, центрального хранилища известно будет затронуто.
Если "главный" репозиторий обновлён, вы также можете применить это обновление к вашему текущему форку.

# **GitHub не ограничен только для разработчиков**

GitHub это отличная платформа, которая меняет работу разработчиков. Тем не менее, каждый,
кто хочет эффективно управлять своим проектом и работать совместно, также может узнать что такое GitHub и как им пользоваться.
'''