'''База данных - это упорядоченный набор структурирований информации или данных,
которе обычно хранятся в электронном виде в компьютерной системе. База данных обычно
управляется системой управления базами данных (СУБД). Даных вместе с СУБД, а также
приложения, котрое с ними связаны, назывется системой баз данных, или, для кратности,
просто базой данных.

Система управления базами данных - это комбинация, состоящая из языковых и программных
средств, которая осуществляет запись данных, доступ к ним, позволяет менять и удалять их,
обезпечивает безопасность данных. СУБД - это система, позволяющая создавать базы данных и 
манипулировать записями, хпанящимся в них. А доступ к даанным СУБД осуществляется 
через специальный язык - SQL.

SQL (structured query language)

MySQL, PostgeSQL, SQlite, Oracle, и MongoDB.

например, FaceBook, Wikipedia, Twiter, Linkedin, Alibab и других

SQlite
На данный момент это одна из самых компактных СУБД. Также она является
встпаиваемой и реляционной.

Вертуальная среда, встроеные модули Python, определение
собственных модулей 

pip install -r .\requirewents.txt'''